app/views/artists/show.html.erb


<% if @artist.songs.any? %>
---
SELECT  1 AS one FROM "songs" WHERE "songs"."artist_id" = $1 LIMIT $2  [["artist_id", 1], ["LIMIT", 1]]
SELECT "songs".* FROM "songs" WHERE "songs"."artist_id" = $1  [["artist_id", 1]]