app/views/songs/new.html.erb

    <%= f.label :artist_id %>
    <%= f.collection_select(:artist_id, Artist.all, :id, :name) %>
---
SELECT "artists".* FROM "artists"