app/controllers/artists_controller.rb

  def index
    @artists = Artist.order_by_name
---
SELECT "artists".* FROM "artists" ORDER BY "artists"."name" ASC

  def destroy
      @artist = Artist.find(params[:id])
      @artist.destroy
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "artists" WHERE "artists"."id" = $1  [["id", 2]]