app/controllers/songs_controller.rb

    def create
        @song = Song.new(song_params)
        @song.artist = @artist
        respond_to do |format|
          if @song.save
---
INSERT INTO "songs" ("genre", "song_name", "duration", "song_url", "created_at", "updated_at", "artist_id") VALUES ($1, $2, $3, $4, $5, $6, $7) RETURNING "id"

    def destroy
      @song = Song.find(params[:id])
      @song.destroy
---
SELECT  "songs".* FROM "songs" WHERE "songs"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
DELETE FROM "songs" WHERE "songs"."id" = $1  [["id", 1]]

    def find_artist
      @artist = Artist.find(params[:artist_id])
---
SELECT  "artists".* FROM "artists" WHERE "artists"."id" = $1 LIMIT $2  [["id", nil], ["LIMIT", 1]]